#  Задание 1.
#
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.
a = input('Введите название лучшей книги февраля: ')
b = input('Ведите количество прочитанных книг за февраль: ')
d = input('Введите количество запланированных книг в феврале: ')
print(
    'Ваша статистика за февраль: ' + 'Лучшая книга: ' + a + ',' + ' Прочитанных книг в феврале: ' + b + ',' + ' Книг по плану: ' + d + '.')
